MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_spi.h
/**
  ******************************************************************************
  * @file    stm32c5xx_hal_spi.h
  * @brief   Header file of SPI HAL module.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32C5XX_HAL_SPI_H
#define STM32C5XX_HAL_SPI_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32c5xx_hal_def.h"
#include "stm32c5xx_ll_spi.h"

/** @addtogroup STM32C5xx_HAL_Driver
  * @{
  */

#if defined(SPI1) || defined(SPI2) || defined(SPI3)

/** @defgroup SPI SPI
  * @{
  */

/* Exported types ------------------------------------------------------------*/
/** @defgroup SPI_Exported_Types SPI Exported Types
  * @{
  */

/**
  * @brief HAL SPI instances enumeration definition.
  */
typedef enum
{
#if defined(SPI1)
  HAL_SPI1 = SPI1_BASE,      /*!< SPI1 instance  */
#endif /* SPI1 */
#if defined(SPI2)
  HAL_SPI2 = SPI2_BASE,      /*!< SPI2 instance  */
#endif /* SPI2 */
#if defined(SPI3)
  HAL_SPI3 = SPI3_BASE,      /*!< SPI3 instance  */
#endif /* SPI3 */
} hal_spi_t;

/**
  * @brief HAL SPI direction mode enumeration definition.
  */
typedef enum
{
  HAL_SPI_DIRECTION_FULL_DUPLEX = LL_SPI_FULL_DUPLEX,      /*!< Full-duplex communication                  */
  HAL_SPI_DIRECTION_SIMPLEX_TX  = LL_SPI_SIMPLEX_TX,       /*!< Simplex communication mode: Transmit only  */
  HAL_SPI_DIRECTION_SIMPLEX_RX  = LL_SPI_SIMPLEX_RX,       /*!< Simplex communication mode: Receive only   */
  HAL_SPI_DIRECTION_HALF_DUPLEX = LL_SPI_HALF_DUPLEX,      /*!< Half-duplex communication                  */
} hal_spi_direction_t;

/**
  * @brief HAL SPI State enumeration definition.
  */
typedef enum
{
  HAL_SPI_STATE_RESET         = 0U,           /*!< 0x00000000 : SPI is not yet initialized or de-initialized        */
  HAL_SPI_STATE_INIT          = (1U << 25U),  /*!< 0x02000000 : SPI is initialized but not yet configured           */
  HAL_SPI_STATE_IDLE          = (1U << 26U),  /*!< 0x04000000 : SPI is initialized and global config applied        */
  HAL_SPI_STATE_TX_ACTIVE     = (1U << 27U),  /*!< 0x08000000 : Data Transmission process is ongoing                */
  HAL_SPI_STATE_RX_ACTIVE     = (1U << 28U),  /*!< 0x10000000 : Data Reception process is ongoing                   */
  HAL_SPI_STATE_TX_RX_ACTIVE  = (1U << 29U),  /*!< 0x20000000 : Data Transmission and Reception process is ongoing  */
  HAL_SPI_STATE_ABORT         = (1U << 30U),  /*!< 0x40000000 : SPI abort is ongoing                                */
  HAL_SPI_STATE_FAULT         = (1U << 31U),  /*!< 0x80000000 : SPI encountered an unrecoverable error and a recovery
                                                  sequence is needed*/
} hal_spi_state_t;


/*! HAL SPI handler type */
typedef struct hal_spi_handle_s hal_spi_handle_t;

/**
  * @brief HAL SPI handle structure definition.
  */
struct hal_spi_handle_s
{
  hal_spi_t                  instance;                                    /*!< SPI instance                       */
  hal_spi_direction_t        direction;                                   /*!< SPI direction                      */
  volatile hal_spi_state_t   global_state;                                /*!< SPI state                          */
#if defined(USE_HAL_SPI_GET_LAST_ERRORS) && (USE_HAL_SPI_GET_LAST_ERRORS == 1)
  volatile uint32_t          last_error_codes;                            /*!< SPI Error code                     */
#endif /* USE_HAL_SPI_GET_LAST_ERRORS */
#if defined(USE_HAL_MUTEX) && (USE_HAL_MUTEX == 1)
  hal_os_semaphore_t         semaphore;                                   /*!< SPI OS semaphore                   */
#endif /* USE_HAL_MUTEX */
  const uint8_t              *p_tx_buff;                                  /*!< Pointer to SPI Tx transfer Buffer  */
  uint16_t                   tx_xfer_size;                                /*!< SPI Tx Transfer size               */
  volatile uint16_t          tx_xfer_count;                               /*!< SPI Tx Transfer Counter            */
  uint8_t                    *p_rx_buff;                                  /*!< Pointer to SPI Rx transfer Buffer  */
  uint16_t                   rx_xfer_size;                                /*!< SPI Rx Transfer size               */
  volatile uint16_t          rx_xfer_count;                               /*!< SPI Rx Transfer Counter            */
  void (*p_rx_isr)(struct hal_spi_handle_s *hspi);                        /*!< Function pointer on Rx ISR         */
  void (*p_tx_isr)(struct hal_spi_handle_s *hspi);                        /*!< Function pointer on Tx ISR         */
#if defined(USE_HAL_SPI_DMA) && (USE_HAL_SPI_DMA == 1)
  hal_dma_handle_t           *hdma_tx;                                    /*!< SPI Tx DMA Handle parameters       */
  hal_dma_handle_t           *hdma_rx;                                    /*!< SPI Rx DMA Handle parameters       */
#endif /* USE_HAL_SPI_DMA */
#if defined(USE_HAL_SPI_USER_DATA) && (USE_HAL_SPI_USER_DATA == 1)
  const void                 *p_user_data;                                /*!< User Data Pointer                  */
#endif /* USE_HAL_SPI_USER_DATA */
#if defined(USE_HAL_SPI_REGISTER_CALLBACKS) && (USE_HAL_SPI_REGISTER_CALLBACKS == 1)
  void (* p_tx_cplt_cb)(struct hal_spi_handle_s *hspi);                   /*!< SPI Tx Completed callback          */
  void (* p_rx_cplt_cb)(struct hal_spi_handle_s *hspi);                   /*!< SPI Rx Completed callback          */
  void (* p_tx_rx_cplt_cb)(struct hal_spi_handle_s *hspi);                /*!< SPI TxRx Completed callback        */
  void (* p_tx_half_cplt_cb)(struct hal_spi_handle_s *hspi);              /*!< SPI Tx Half Completed callback     */
  void (* p_rx_half_cplt_cb)(struct hal_spi_handle_s *hspi);              /*!< SPI Rx Half Completed callback     */
  void (* p_tx_rx_half_cplt_cb)(struct hal_spi_handle_s *hspi);           /*!< SPI TxRx Half Completed callback   */
  void (* p_error_cb)(struct hal_spi_handle_s *hspi);                     /*!< SPI Error callback                 */
  void (* p_abort_cplt_cb)(struct hal_spi_handle_s *hspi);                /*!< SPI Abort callback                 */
  void (* p_suspend_cb)(struct hal_spi_handle_s *hspi);                   /*!< SPI Suspend callback               */
#endif  /* USE_HAL_SPI_REGISTER_CALLBACKS */
};

#if defined(USE_HAL_SPI_REGISTER_CALLBACKS) && (USE_HAL_SPI_REGISTER_CALLBACKS == 1)
typedef  void (*hal_spi_cb_t)(hal_spi_handle_t *hspi);                    /*!< HAL SPI Callback pointer           */
#endif  /* USE_HAL_SPI_REGISTER_CALLBACKS */

/**
  * @brief HAL SPI mode enumeration definition.
  */
typedef enum
{
  HAL_SPI_MODE_SLAVE  = LL_SPI_MODE_SLAVE,          /*!< Slave mode */
  HAL_SPI_MODE_MASTER = LL_SPI_MODE_MASTER,         /*!< Master mode */
} hal_spi_mode_t;

/**
  * @brief HAL SPI data width enumeration definition.
  */
typedef enum
{
  HAL_SPI_DATA_WIDTH_4_BIT  = LL_SPI_DATA_WIDTH_4_BIT,    /*!< 4-bits            */
  HAL_SPI_DATA_WIDTH_5_BIT  = LL_SPI_DATA_WIDTH_5_BIT,    /*!< 5-bits            */
  HAL_SPI_DATA_WIDTH_6_BIT  = LL_SPI_DATA_WIDTH_6_BIT,    /*!< 6-bits            */
  HAL_SPI_DATA_WIDTH_7_BIT  = LL_SPI_DATA_WIDTH_7_BIT,    /*!< 7-bits            */
  HAL_SPI_DATA_WIDTH_8_BIT  = LL_SPI_DATA_WIDTH_8_BIT,    /*!< 8-bits            */
  HAL_SPI_DATA_WIDTH_9_BIT  = LL_SPI_DATA_WIDTH_9_BIT,    /*!< 9-bits            */
  HAL_SPI_DATA_WIDTH_10_BIT = LL_SPI_DATA_WIDTH_10_BIT,   /*!< 10-bits           */
  HAL_SPI_DATA_WIDTH_11_BIT = LL_SPI_DATA_WIDTH_11_BIT,   /*!< 11-bits           */
  HAL_SPI_DATA_WIDTH_12_BIT = LL_SPI_DATA_WIDTH_12_BIT,   /*!< 12-bits           */
  HAL_SPI_DATA_WIDTH_13_BIT = LL_SPI_DATA_WIDTH_13_BIT,   /*!< 13-bits           */
  HAL_SPI_DATA_WIDTH_14_BIT = LL_SPI_DATA_WIDTH_14_BIT,   /*!< 14-bits           */
  HAL_SPI_DATA_WIDTH_15_BIT = LL_SPI_DATA_WIDTH_15_BIT,   /*!< 15-bits           */
  HAL_SPI_DATA_WIDTH_16_BIT = LL_SPI_DATA_WIDTH_16_BIT,   /*!< 16-bits           */
  HAL_SPI_DATA_WIDTH_17_BIT = LL_SPI_DATA_WIDTH_17_BIT,   /*!< 17-bits           */
  HAL_SPI_DATA_WIDTH_18_BIT = LL_SPI_DATA_WIDTH_18_BIT,   /*!< 18-bits           */
  HAL_SPI_DATA_WIDTH_19_BIT = LL_SPI_DATA_WIDTH_19_BIT,   /*!< 19-bits           */
  HAL_SPI_DATA_WIDTH_20_BIT = LL_SPI_DATA_WIDTH_20_BIT,   /*!< 20-bits           */
  HAL_SPI_DATA_WIDTH_21_BIT = LL_SPI_DATA_WIDTH_21_BIT,   /*!< 21-bits           */
  HAL_SPI_DATA_WIDTH_22_BIT = LL_SPI_DATA_WIDTH_22_BIT,   /*!< 22-bits           */
  HAL_SPI_DATA_WIDTH_23_BIT = LL_SPI_DATA_WIDTH_23_BIT,   /*!< 23-bits           */
  HAL_SPI_DATA_WIDTH_24_BIT = LL_SPI_DATA_WIDTH_24_BIT,   /*!< 24-bits           */
  HAL_SPI_DATA_WIDTH_25_BIT = LL_SPI_DATA_WIDTH_25_BIT,   /*!< 25-bits           */
  HAL_SPI_DATA_WIDTH_26_BIT = LL_SPI_DATA_WIDTH_26_BIT,   /*!< 26-bits           */
  HAL_SPI_DATA_WIDTH_27_BIT = LL_SPI_DATA_WIDTH_27_BIT,   /*!< 27-bits           */
  HAL_SPI_DATA_WIDTH_28_BIT = LL_SPI_DATA_WIDTH_28_BIT,   /*!< 28-bits           */
  HAL_SPI_DATA_WIDTH_29_BIT = LL_SPI_DATA_WIDTH_29_BIT,   /*!< 29-bits           */
  HAL_SPI_DATA_WIDTH_30_BIT = LL_SPI_DATA_WIDTH_30_BIT,   /*!< 30-bits           */
  HAL_SPI_DATA_WIDTH_31_BIT = LL_SPI_DATA_WIDTH_31_BIT,   /*!< 31-bits           */
  HAL_SPI_DATA_WIDTH_32_BIT = LL_SPI_DATA_WIDTH_32_BIT,   /*!< 32-bits           */
} hal_spi_data_width_t;

/**
  * @brief HAL SPI clock polarity enumeration definition.
  */
typedef enum
{
  HAL_SPI_CLOCK_POLARITY_LOW  = LL_SPI_CLOCK_POLARITY_LOW,     /*!< SCK signal is at 0 when idle */
  HAL_SPI_CLOCK_POLARITY_HIGH = LL_SPI_CLOCK_POLARITY_HIGH,    /*!< SCK signal is at 1 when idle */
} hal_spi_clock_polarity_t;

/**
  * @brief HAL SPI clock phase enumeration definition.
  */
typedef enum
{
  HAL_SPI_CLOCK_PHASE_1_EDGE = LL_SPI_CLOCK_PHASE_1_EDGE,      /*!< The first clock transition is the
                                                                    first data capture edge  */
  HAL_SPI_CLOCK_PHASE_2_EDGE = LL_SPI_CLOCK_PHASE_2_EDGE,      /*!< The second clock transition is the
                                                                    first data capture edge */
} hal_spi_clock_phase_t;

/**
  * @brief HAL SPI driver baudrate prescaler enumeration definition.
  */
typedef enum
{
  HAL_SPI_BAUD_RATE_PRESCALER_2         = LL_SPI_BAUD_RATE_PRESCALER_2,          /*!< SPI master clock/2               */
  HAL_SPI_BAUD_RATE_PRESCALER_4         = LL_SPI_BAUD_RATE_PRESCALER_4,          /*!< SPI master clock/4               */
  HAL_SPI_BAUD_RATE_PRESCALER_8         = LL_SPI_BAUD_RATE_PRESCALER_8,          /*!< SPI master clock/8               */
  HAL_SPI_BAUD_RATE_PRESCALER_16        = LL_SPI_BAUD_RATE_PRESCALER_16,         /*!< SPI master clock/16              */
  HAL_SPI_BAUD_RATE_PRESCALER_32        = LL_SPI_BAUD_RATE_PRESCALER_32,         /*!< SPI master clock/32              */
  HAL_SPI_BAUD_RATE_PRESCALER_64        = LL_SPI_BAUD_RATE_PRESCALER_64,         /*!< SPI master clock/64              */
  HAL_SPI_BAUD_RATE_PRESCALER_128       = LL_SPI_BAUD_RATE_PRESCALER_128,        /*!< SPI master clock/128             */
  HAL_SPI_BAUD_RATE_PRESCALER_256       = LL_SPI_BAUD_RATE_PRESCALER_256,        /*!< SPI master clock/256             */
  HAL_SPI_BAUD_RATE_PRESCALER_BYPASS    = LL_SPI_BAUD_RATE_PRESCALER_BYPASS,     /*!< Bypass from RCC in Master mode   */
} hal_spi_baud_rate_prescaler_t;

/**
  * @brief HAL SPI MSB LSB transmission enumeration definition.
  */
typedef enum
{
  HAL_SPI_MSB_FIRST = LL_SPI_MSB_FIRST,              /*!< MSB transmitted first  */
  HAL_SPI_LSB_FIRST = LL_SPI_LSB_FIRST,              /*!< LSB transmitted first  */
} hal_spi_first_bit_t;

/**
  * @brief HAL SPI slave select management enumeration definition.
  */
typedef enum
{
  HAL_SPI_NSS_PIN_MGMT_INTERNAL   = LL_SPI_NSS_SOFT,        /*!< In this configuration the Slave select is driven
                                                                 internally. The external slave select pin is free
                                                                 for other application uses. */
  HAL_SPI_NSS_PIN_MGMT_INPUT      = LL_SPI_NSS_HARD_INPUT,  /*!< In Slave mode, the slave select pin works as a standard
                                                                 chip select input and the slave is selected while the
                                                                 slave select line is at its active level. In Master
                                                                 mode, this configuration allows multi-master
                                                                 capability. If the slave select pin is pulled into an
                                                                 active level in this mode, the SPI enters Master mode
                                                                 fault state and the SPI device is automatically
                                                                 reconfigured in Slave mode (MASTER = 0) */
  HAL_SPI_NSS_PIN_MGMT_OUTPUT     = LL_SPI_NSS_HARD_OUTPUT, /*!< This configuration is only used when the MCU is set as
                                                                 master (multi-master not allowed). The slave select pin
                                                                 active level is managed by the hardware. The
                                                                 functionality is tied to CSTART and EOT control. */
} hal_spi_nss_pin_management_t;

/**
  * @brief HAL SPI configuration structure definition.
  */
typedef struct
{
  hal_spi_mode_t                 mode;               /*!< The SPI operating mode. */
  hal_spi_direction_t            direction;          /*!< The SPI bidirectional mode state. */
  hal_spi_data_width_t           data_width;         /*!< The SPI data width.*/
  hal_spi_clock_polarity_t       clock_polarity;     /*!< The serial clock steady state.*/
  hal_spi_clock_phase_t          clock_phase;        /*!< The clock active edge for the bit capture.*/
  hal_spi_baud_rate_prescaler_t   baud_rate_prescaler; /*!< The Baud Rate prescaler value which will be used to
                                                          configure the transmit and receive SCK clock.*/
  hal_spi_first_bit_t            first_bit;          /*!< Specifies whether data transfers start from MSB or
                                                          LSB bit.*/
  hal_spi_nss_pin_management_t   nss_pin_management; /*!< SPI Slave Select Pin Management .*/

} hal_spi_config_t;

#if defined(USE_HAL_SPI_CRC) && (USE_HAL_SPI_CRC == 1)

/**
  * @brief HAL SPI CRC feature status enumeration definition.
  */
typedef enum
{
  HAL_SPI_CRC_DISABLED = 0U,  /*!<  CRC feature disabled */
  HAL_SPI_CRC_ENABLED  = 1U,  /*!<  CRC feature enabled  */
} hal_spi_crc_status_t;

/**
  * @brief HAL SPI CRC length enumeration definition.
  */
typedef enum
{
  HAL_SPI_CRC_LENGTH_DATASIZE = (0UL),                       /*!< Datasize length CRC   */
  HAL_SPI_CRC_LENGTH_4_BIT     = LL_SPI_CRC_LENGTH_4_BIT,    /*!< 4-bit length CRC      */
  HAL_SPI_CRC_LENGTH_5_BIT     = LL_SPI_CRC_LENGTH_5_BIT,    /*!< 5-bit length CRC      */
  HAL_SPI_CRC_LENGTH_6_BIT     = LL_SPI_CRC_LENGTH_6_BIT,    /*!< 6-bit length CRC      */
  HAL_SPI_CRC_LENGTH_7_BIT     = LL_SPI_CRC_LENGTH_7_BIT,    /*!< 7-bit length CRC      */
  HAL_SPI_CRC_LENGTH_8_BIT     = LL_SPI_CRC_LENGTH_8_BIT,    /*!< 8-bit length CRC      */
  HAL_SPI_CRC_LENGTH_9_BIT     = LL_SPI_CRC_LENGTH_9_BIT,    /*!< 9-bit length CRC      */
  HAL_SPI_CRC_LENGTH_10_BIT    = LL_SPI_CRC_LENGTH_10_BIT,   /*!< 10-bit length CRC     */
  HAL_SPI_CRC_LENGTH_11_BIT    = LL_SPI_CRC_LENGTH_11_BIT,   /*!< 11-bit length CRC     */
  HAL_SPI_CRC_LENGTH_12_BIT    = LL_SPI_CRC_LENGTH_12_BIT,   /*!< 12-bit length CRC     */
  HAL_SPI_CRC_LENGTH_13_BIT    = LL_SPI_CRC_LENGTH_13_BIT,   /*!< 13-bit length CRC     */
  HAL_SPI_CRC_LENGTH_14_BIT    = LL_SPI_CRC_LENGTH_14_BIT,   /*!< 14-bit length CRC     */
  HAL_SPI_CRC_LENGTH_15_BIT    = LL_SPI_CRC_LENGTH_15_BIT,   /*!< 15-bit length CRC     */
  HAL_SPI_CRC_LENGTH_16_BIT    = LL_SPI_CRC_LENGTH_16_BIT,   /*!< 16-bit length CRC     */
  HAL_SPI_CRC_LENGTH_17_BIT    = LL_SPI_CRC_LENGTH_17_BIT,   /*!< 17-bit length CRC     */
  HAL_SPI_CRC_LENGTH_18_BIT    = LL_SPI_CRC_LENGTH_18_BIT,   /*!< 18-bit length CRC     */
  HAL_SPI_CRC_LENGTH_19_BIT    = LL_SPI_CRC_LENGTH_19_BIT,   /*!< 19-bit length CRC     */
  HAL_SPI_CRC_LENGTH_20_BIT    = LL_SPI_CRC_LENGTH_20_BIT,   /*!< 20-bit length CRC     */
  HAL_SPI_CRC_LENGTH_21_BIT    = LL_SPI_CRC_LENGTH_21_BIT,   /*!< 21-bit length CRC     */
  HAL_SPI_CRC_LENGTH_22_BIT    = LL_SPI_CRC_LENGTH_22_BIT,   /*!< 22-bit length CRC     */
  HAL_SPI_CRC_LENGTH_23_BIT    = LL_SPI_CRC_LENGTH_23_BIT,   /*!< 23-bit length CRC     */
  HAL_SPI_CRC_LENGTH_24_BIT    = LL_SPI_CRC_LENGTH_24_BIT,   /*!< 24-bit length CRC     */
  HAL_SPI_CRC_LENGTH_25_BIT    = LL_SPI_CRC_LENGTH_25_BIT,   /*!< 25-bit length CRC     */
  HAL_SPI_CRC_LENGTH_26_BIT    = LL_SPI_CRC_LENGTH_26_BIT,   /*!< 26-bit length CRC     */
  HAL_SPI_CRC_LENGTH_27_BIT    = LL_SPI_CRC_LENGTH_27_BIT,   /*!< 27-bit length CRC     */
  HAL_SPI_CRC_LENGTH_28_BIT    = LL_SPI_CRC_LENGTH_28_BIT,   /*!< 28-bit length CRC     */
  HAL_SPI_CRC_LENGTH_29_BIT    = LL_SPI_CRC_LENGTH_29_BIT,   /*!< 29-bit length CRC     */
  HAL_SPI_CRC_LENGTH_30_BIT    = LL_SPI_CRC_LENGTH_30_BIT,   /*!< 30-bit length CRC     */
  HAL_SPI_CRC_LENGTH_31_BIT    = LL_SPI_CRC_LENGTH_31_BIT,   /*!< 31-bit length CRC     */
  HAL_SPI_CRC_LENGTH_32_BIT    = LL_SPI_CRC_LENGTH_32_BIT,   /*!< 32-bit length CRC     */
} hal_spi_crc_length_t;

/**
  * @brief HAL SPI TX CRC calculation initialization pattern enumeration definition.
  */
typedef enum
{
  HAL_SPI_CRC_TX_INIT_PATTERN_ALL_ZERO = LL_SPI_CRC_TX_INIT_PATTERN_ALL_ZERO,   /*!< CRC TX Initialization patterns
                                                                                   configured to zero  */
  HAL_SPI_CRC_TX_INIT_PATTERN_ALL_ONE  = LL_SPI_CRC_TX_INIT_PATTERN_ALL_ONE,   /*!< CRC TX Initialization patterns
                                                                                   configured to one   */
} hal_spi_crc_tx_init_pattern_t;

/**
  * @brief HAL SPI RX CRC calculation initialization pattern enumeration definition.
  */
typedef enum
{
  HAL_SPI_CRC_RX_INIT_PATTERN_ALL_ZERO = LL_SPI_CRC_RX_INIT_PATTERN_ALL_ZERO,   /*!< CRC RX Initialization patterns
                                                                                   configured to zero  */
  HAL_SPI_CRC_RX_INIT_PATTERN_ALL_ONE  = LL_SPI_CRC_RX_INIT_PATTERN_ALL_ONE,   /*!< CRC RX Initialization patterns
                                                                                   configured to one   */
} hal_spi_crc_rx_init_pattern_t;

/**
  * @brief HAL SPI CRC configuration structure definition.
  */
typedef struct
{
  uint32_t                      crc_polynomial;       /*!< The polynomial used for the CRC calculation. This
                                                           parameter must be an odd number between Min_Data = 0 and
                                                           Max_Data = 65535 */
  hal_spi_crc_length_t          crc_length;           /*!< The CRC Length used for the CRC calculation. */
  hal_spi_crc_tx_init_pattern_t crc_tx_init_pattern;  /*!< The transmitter CRC initialization Pattern used for the CRC
                                                           calculation.*/
  hal_spi_crc_rx_init_pattern_t crc_rx_init_pattern;  /*!< The receiver CRC initialization Pattern used for the CRC
                                                           calculation.*/
} hal_spi_crc_config_t;

#endif /* USE_HAL_SPI_CRC */

/**
  * @brief HAL SPI NSS pulse mode enumeration definition.
  */
typedef enum
{
  HAL_SPI_NSS_PULSE_DISABLE = LL_SPI_NSS_PULSE_DISABLE,   /*!< Slave select IO pin is kept at active level till data transfer is
                                                               completed, it becomes inactive with EOT flag  */
  HAL_SPI_NSS_PULSE_ENABLE  = LL_SPI_NSS_PULSE_ENABLE,    /*!< SPI data frames are interleaved with slave select IO pin non active
                                                               pulses when MIDI[3:0]>1  */
} hal_spi_nss_pulse_t;

/**
  * @brief HAL SPI NSS polarity enumeration definition.
  */
typedef enum
{
  HAL_SPI_NSS_POLARITY_LOW  = LL_SPI_NSS_POLARITY_LOW,     /*!< Low level is active for slave select signal  */
  HAL_SPI_NSS_POLARITY_HIGH = LL_SPI_NSS_POLARITY_HIGH,    /*!< High level is active for slave select signal */
} hal_spi_nss_polarity_t;

/**
  * @brief HAL SPI Master slave select IO pin  Idleness enumeration definition.
  */
typedef enum
{
  HAL_SPI_NSS_MSSI_DELAY_0_CYCLE  = LL_SPI_MSSI_DELAY_0_CYCLE,   /*!< No extra delay                     */
  HAL_SPI_NSS_MSSI_DELAY_1_CYCLE  = LL_SPI_MSSI_DELAY_1_CYCLE,   /*!< 1 clock cycle period delay added   */
  HAL_SPI_NSS_MSSI_DELAY_2_CYCLE  = LL_SPI_MSSI_DELAY_2_CYCLE,   /*!< 2 clock cycles period delay added  */
  HAL_SPI_NSS_MSSI_DELAY_3_CYCLE  = LL_SPI_MSSI_DELAY_3_CYCLE,   /*!< 3 clock cycles period delay added  */
  HAL_SPI_NSS_MSSI_DELAY_4_CYCLE  = LL_SPI_MSSI_DELAY_4_CYCLE,   /*!< 4 clock cycles period delay added  */
  HAL_SPI_NSS_MSSI_DELAY_5_CYCLE  = LL_SPI_MSSI_DELAY_5_CYCLE,   /*!< 5 clock cycles period delay added  */
  HAL_SPI_NSS_MSSI_DELAY_6_CYCLE  = LL_SPI_MSSI_DELAY_6_CYCLE,   /*!< 6 clock cycles period delay added  */
  HAL_SPI_NSS_MSSI_DELAY_7_CYCLE  = LL_SPI_MSSI_DELAY_7_CYCLE,   /*!< 7 clock cycles period delay added  */
  HAL_SPI_NSS_MSSI_DELAY_8_CYCLE  = LL_SPI_MSSI_DELAY_8_CYCLE,   /*!< 8 clock cycles period delay added  */
  HAL_SPI_NSS_MSSI_DELAY_9_CYCLE  = LL_SPI_MSSI_DELAY_9_CYCLE,   /*!< 9 clock cycles period delay added  */
  HAL_SPI_NSS_MSSI_DELAY_10_CYCLE = LL_SPI_MSSI_DELAY_10_CYCLE,  /*!< 10 clock cycles period delay added */
  HAL_SPI_NSS_MSSI_DELAY_11_CYCLE = LL_SPI_MSSI_DELAY_11_CYCLE,  /*!< 11 clock cycles period delay added */
  HAL_SPI_NSS_MSSI_DELAY_12_CYCLE = LL_SPI_MSSI_DELAY_12_CYCLE,  /*!< 12 clock cycles period delay added */
  HAL_SPI_NSS_MSSI_DELAY_13_CYCLE = LL_SPI_MSSI_DELAY_13_CYCLE,  /*!< 13 clock cycles period delay added */
  HAL_SPI_NSS_MSSI_DELAY_14_CYCLE = LL_SPI_MSSI_DELAY_14_CYCLE,  /*!< 14 clock cycles period delay added */
  HAL_SPI_NSS_MSSI_DELAY_15_CYCLE = LL_SPI_MSSI_DELAY_15_CYCLE,  /*!< 15 clock cycles period delay added */
} hal_spi_nss_master_slave_signal_idleness_delay_t;

