MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_spi.h
/**
  * @brief HAL SPI NSS configuration structure definition.
  */
typedef struct
{
  hal_spi_nss_pulse_t           nss_pulse;           /*!< Specifies whether the NSS signal is managed by hardware */
  hal_spi_nss_polarity_t        nss_polarity;        /*!< Specifies which level of slave select input/output external
                                                          signal (present on SS pin) considered as active one. */
  hal_spi_nss_master_slave_signal_idleness_delay_t      nss_mssi_delay;      /*!< Specifies an extra delay, expressed in number of SPI clock
                                                          cycle periods, inserted additionally between active edge of
                                                          slave select opening a session and the beginning of the first
                                                          data frame of the session in Master mode when SSOE is enabled.
                                                          This feature is not supported in TI mode.
                                                          To include the delay, the SPI must be disabled and re-enabled
                                                          between sessions.*/
} hal_spi_nss_config_t;

/**
  * @brief HAL SPI Master Inter-Data Idleness enumeration definition.
  */
typedef enum
{
  HAL_SPI_MIDI_DELAY_0_CYCLE  = LL_SPI_MIDI_DELAY_0_CYCLE,       /*!< No delay                      */
  HAL_SPI_MIDI_DELAY_1_CYCLE  = LL_SPI_MIDI_DELAY_1_CYCLE,       /*!< 1 clock cycle period delay    */
  HAL_SPI_MIDI_DELAY_2_CYCLE  = LL_SPI_MIDI_DELAY_2_CYCLE,       /*!< 2 clock cycles period delay   */
  HAL_SPI_MIDI_DELAY_3_CYCLE  = LL_SPI_MIDI_DELAY_3_CYCLE,       /*!< 3 clock cycles period delay   */
  HAL_SPI_MIDI_DELAY_4_CYCLE  = LL_SPI_MIDI_DELAY_4_CYCLE,       /*!< 4 clock cycles period delay   */
  HAL_SPI_MIDI_DELAY_5_CYCLE  = LL_SPI_MIDI_DELAY_5_CYCLE,       /*!< 5 clock cycles period delay   */
  HAL_SPI_MIDI_DELAY_6_CYCLE  = LL_SPI_MIDI_DELAY_6_CYCLE,       /*!< 6 clock cycles period delay   */
  HAL_SPI_MIDI_DELAY_7_CYCLE  = LL_SPI_MIDI_DELAY_7_CYCLE,       /*!< 7 clock cycles period delay   */
  HAL_SPI_MIDI_DELAY_8_CYCLE  = LL_SPI_MIDI_DELAY_8_CYCLE,       /*!< 8 clock cycles period delay   */
  HAL_SPI_MIDI_DELAY_9_CYCLE  = LL_SPI_MIDI_DELAY_9_CYCLE,       /*!< 9 clock cycles period delay   */
  HAL_SPI_MIDI_DELAY_10_CYCLE = LL_SPI_MIDI_DELAY_10_CYCLE,      /*!< 10 clock cycles period delay  */
  HAL_SPI_MIDI_DELAY_11_CYCLE = LL_SPI_MIDI_DELAY_11_CYCLE,      /*!< 11 clock cycles period delay  */
  HAL_SPI_MIDI_DELAY_12_CYCLE = LL_SPI_MIDI_DELAY_12_CYCLE,      /*!< 12 clock cycles period delay  */
  HAL_SPI_MIDI_DELAY_13_CYCLE = LL_SPI_MIDI_DELAY_13_CYCLE,      /*!< 13 clock cycles period delay  */
  HAL_SPI_MIDI_DELAY_14_CYCLE = LL_SPI_MIDI_DELAY_14_CYCLE,      /*!< 14 clock cycles period delay  */
  HAL_SPI_MIDI_DELAY_15_CYCLE = LL_SPI_MIDI_DELAY_15_CYCLE,      /*!< 15 clock cycles period delay  */
} hal_spi_master_inter_data_idleness_delay_t;

/**
  * @brief HAL SPI underrun behavior enumeration definition.
  */
typedef enum
{
  HAL_SPI_UNDERRUN_BEHAV_REGISTER_PATTERN  = LL_SPI_UNDERRUN_CONFIG_REGISTER_PATTERN,    /*!< Slave sends a constant
                                                                                          pattern defined by the user
                                                                                          at the SPI_UDRDR register */
  HAL_SPI_UNDERRUN_BEHAV_LAST_RECEIVED     = LL_SPI_UNDERRUN_CONFIG_LAST_RECEIVED,       /*!< Slave repeats last
                                                                                          received data from master */
} hal_spi_underrun_behavior_t;


/**
  * @brief HAL SPI underrun detection configuration structure definition.
  */
typedef struct
{
  hal_spi_underrun_behavior_t     underrun_behavior;   /*!< Behavior of slave transmitter at underrun condition  */
} hal_spi_underrun_config_t;

/**
  * @brief HAL SPI TI mode feature status enumeration definition.
  */
typedef enum
{
  HAL_SPI_TI_MODE_DISABLED = 0U,                 /*!< TI mode feature disabled */
  HAL_SPI_TI_MODE_ENABLED  = 1U,                 /*!< TI mode feature enabled  */
} hal_spi_ti_mode_status_t;

/**
  * @brief HAL SPI Master Receiver automatic suspension feature status enumeration definition.
  */
typedef enum
{
  HAL_SPI_MASTER_RX_AUTO_SUSPEND_DISABLED = 0U,     /*!< Master receiver automatic suspension feature disabled */
  HAL_SPI_MASTER_RX_AUTO_SUSPEND_ENABLED  = 1U,     /*!< Master receiver automatic suspension feature enabled  */
} hal_spi_master_rx_auto_suspend_status_t;

/**
  * @brief HAL SPI Master keep IO state feature status enumeration definition.
  */
typedef enum
{
  HAL_SPI_MASTER_KEEP_IO_STATE_DISABLED = 0U,   /*!< Master keep IO state feature disabled */
  HAL_SPI_MASTER_KEEP_IO_STATE_ENABLED  = 1U,   /*!< Master keep IO state feature enabled  */
} hal_spi_master_keep_io_state_status_t;

/**
  * @brief HAL SPI io swap feature status enumeration definition.
  */
typedef enum
{
  HAL_SPI_MOSI_MISO_SWAP_DISABLED = 0U,                          /*!< IO swap feature disabled */
  HAL_SPI_MOSI_MISO_SWAP_ENABLED  = 1U,                          /*!< IO swap feature enabled  */
} hal_spi_mosi_miso_swap_status_t;


/**
  * @brief HAL SPI ready pin feature status enumeration definition.
  */
typedef enum
{
  HAL_SPI_READY_PIN_DISABLED = 0U,               /*!<  Ready pin feature disabled */
  HAL_SPI_READY_PIN_ENABLED  = 1U,               /*!<  Ready pin feature enabled  */
} hal_spi_ready_pin_status_t;

/**
  * @brief HAL SPI ready pin input/output polarity enumeration definition.
  */
typedef enum
{
  HAL_SPI_READY_PIN_POLARITY_HIGH = LL_SPI_READY_PIN_POLARITY_HIGH, /*!< High level of the signal means the slave is
                                                                     ready for communication */
  HAL_SPI_READY_PIN_POLARITY_LOW  = LL_SPI_READY_PIN_POLARITY_LOW,  /*!< Low level of the signal means the slave is
                                                                     ready for communication  */
} hal_spi_ready_pin_polarity_t;

/**
  * @brief HAL SPI Delay Read Data Sampling feature status enumeration definition.
  */
typedef enum
{
  HAL_SPI_DRDS_DISABLED = 0U,               /*!<  Delay Read Data Sampling feature disabled */
  HAL_SPI_DRDS_ENABLED  = 1U,               /*!<  Delay Read Data Sampling feature enabled  */
} hal_spi_drds_status_t;

/**
  * @brief HAL SPI io configuration feature status enumeration definition.
  */
typedef enum
{
  HAL_SPI_IO_CFG_UNLOCKED = 0U,               /*!< IO configuration feature unlocked */
  HAL_SPI_IO_CFG_LOCKED   = 1U,               /*!< IO configuration feature locked   */
} hal_spi_io_cfg_status_t;

/**
  * @brief HAL SPI FIFO threshold level enumeration definition.
  */
typedef enum
{
  HAL_SPI_FIFO_THRESHOLD_1_DATA  = LL_SPI_FIFO_THRESHOLD_1_DATA,    /*!< 1-data  */
  HAL_SPI_FIFO_THRESHOLD_2_DATA  = LL_SPI_FIFO_THRESHOLD_2_DATA,    /*!< 2-data  */
  HAL_SPI_FIFO_THRESHOLD_3_DATA  = LL_SPI_FIFO_THRESHOLD_3_DATA,    /*!< 3-data  */
  HAL_SPI_FIFO_THRESHOLD_4_DATA  = LL_SPI_FIFO_THRESHOLD_4_DATA,    /*!< 4-data  */
  HAL_SPI_FIFO_THRESHOLD_5_DATA  = LL_SPI_FIFO_THRESHOLD_5_DATA,    /*!< 5-data  */
  HAL_SPI_FIFO_THRESHOLD_6_DATA  = LL_SPI_FIFO_THRESHOLD_6_DATA,    /*!< 6-data  */
  HAL_SPI_FIFO_THRESHOLD_7_DATA  = LL_SPI_FIFO_THRESHOLD_7_DATA,    /*!< 7-data  */
  HAL_SPI_FIFO_THRESHOLD_8_DATA  = LL_SPI_FIFO_THRESHOLD_8_DATA,    /*!< 8-data  */
  HAL_SPI_FIFO_THRESHOLD_9_DATA  = LL_SPI_FIFO_THRESHOLD_9_DATA,    /*!< 9-data  */
  HAL_SPI_FIFO_THRESHOLD_10_DATA = LL_SPI_FIFO_THRESHOLD_10_DATA,   /*!< 10-data  */
  HAL_SPI_FIFO_THRESHOLD_11_DATA = LL_SPI_FIFO_THRESHOLD_11_DATA,   /*!< 11-data  */
  HAL_SPI_FIFO_THRESHOLD_12_DATA = LL_SPI_FIFO_THRESHOLD_12_DATA,   /*!< 12-data  */
  HAL_SPI_FIFO_THRESHOLD_13_DATA = LL_SPI_FIFO_THRESHOLD_13_DATA,   /*!< 13-data  */
  HAL_SPI_FIFO_THRESHOLD_14_DATA = LL_SPI_FIFO_THRESHOLD_14_DATA,   /*!< 14-data  */
  HAL_SPI_FIFO_THRESHOLD_15_DATA = LL_SPI_FIFO_THRESHOLD_15_DATA,   /*!< 15-data  */
  HAL_SPI_FIFO_THRESHOLD_16_DATA = LL_SPI_FIFO_THRESHOLD_16_DATA,   /*!< 16-data  */
} hal_spi_fifo_threshold_t;

/**
  * @}
  */

/* Exported constants --------------------------------------------------------*/
/** @defgroup SPI_Exported_Constants SPI Exported Constants
  * @{
  */
#if defined(USE_HAL_SPI_GET_LAST_ERRORS) && (USE_HAL_SPI_GET_LAST_ERRORS == 1)

