MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_spi.h
/** @defgroup SPI_Error_Code SPI Error Codes
  * @{
  */
#define HAL_SPI_ERROR_NONE                     (0UL)           /*!< 0x00000000: No error                              */
#define HAL_SPI_ERROR_MODF                     (0x01UL << 0U)  /*!< 0x00000001: Mode fault error                      */
#if defined(USE_HAL_SPI_CRC) && (USE_HAL_SPI_CRC == 1)
#define HAL_SPI_ERROR_CRC                      (0x01UL << 1U)  /*!< 0x00000002: CRC error                             */
#endif /* USE_HAL_SPI_CRC */
#define HAL_SPI_ERROR_OVR                      (0x01UL << 2U)  /*!< 0x00000004: Overrun error                         */
#define HAL_SPI_ERROR_FRE                      (0x01UL << 3U)  /*!< 0x00000008: Frame format error                    */
#if defined(USE_HAL_SPI_DMA) && (USE_HAL_SPI_DMA == 1)
#define HAL_SPI_ERROR_DMA                      (0x01UL << 4U)  /*!< 0x00000010: DMA transfer error                    */
#endif /* USE_HAL_SPI_DMA */
#define HAL_SPI_ERROR_ABORT                    (0x01UL << 5U)  /*!< 0x00000020: Error during SPI Abort procedure      */
#define HAL_SPI_ERROR_UDR                      (0x01UL << 6U)  /*!< 0x00000040: Underrun error                        */
/**
  * @}
  */
#endif /* USE_HAL_SPI_GET_LAST_ERRORS */

/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @defgroup SPI_Exported_Functions SPI Exported Functions
  * @{
  */

/** @defgroup SPI_Exported_Functions_Group1 Initialization / De-Initialization functions
  * @{
  */
hal_status_t HAL_SPI_Init(hal_spi_handle_t *hspi, hal_spi_t instance);
void HAL_SPI_DeInit(hal_spi_handle_t *hspi);

/**
  * @}
  */

/** @defgroup SPI_Exported_Functions_Group2 General Config functions
  * @{
  */
hal_status_t HAL_SPI_SetConfig(hal_spi_handle_t *hspi, const hal_spi_config_t *p_config);
void HAL_SPI_GetConfig(const hal_spi_handle_t *hspi, hal_spi_config_t *p_config);

/**
  * @}
  */

/** @defgroup SPI_Exported_Functions_Group3 Features functions
  * @{
  */
#if defined(USE_HAL_SPI_CRC) && (USE_HAL_SPI_CRC == 1)
hal_status_t HAL_SPI_SetConfigCRC(hal_spi_handle_t *hspi, const hal_spi_crc_config_t *p_config);
void         HAL_SPI_GetConfigCRC(const hal_spi_handle_t *hspi, hal_spi_crc_config_t *p_config);
hal_status_t HAL_SPI_EnableCRC(const hal_spi_handle_t *hspi);
hal_status_t HAL_SPI_DisableCRC(const hal_spi_handle_t *hspi);
hal_spi_crc_status_t HAL_SPI_IsEnabledCRC(const hal_spi_handle_t *hspi);
#endif /* USE_HAL_SPI_CRC */

hal_status_t HAL_SPI_SetConfigNSS(hal_spi_handle_t *hspi, const hal_spi_nss_config_t *p_config);
void HAL_SPI_GetConfigNSS(const hal_spi_handle_t *hspi, hal_spi_nss_config_t *p_config);

hal_status_t HAL_SPI_SLAVE_SetConfigUnderrun(const hal_spi_handle_t *hspi, const hal_spi_underrun_config_t *p_config);
void HAL_SPI_SLAVE_GetConfigUnderrun(const hal_spi_handle_t *hspi, hal_spi_underrun_config_t *p_config);

hal_status_t HAL_SPI_EnableTIMode(hal_spi_handle_t *hspi);
hal_status_t HAL_SPI_DisableTIMode(hal_spi_handle_t *hspi);
hal_spi_ti_mode_status_t HAL_SPI_IsEnabledTIMode(const hal_spi_handle_t *hspi);

hal_status_t HAL_SPI_MASTER_EnableReceiverAutoSuspend(const hal_spi_handle_t *hspi);
hal_status_t HAL_SPI_MASTER_DisableReceiverAutoSuspend(const hal_spi_handle_t *hspi);
hal_spi_master_rx_auto_suspend_status_t HAL_SPI_MASTER_IsEnabledReceiverAutoSuspend(const hal_spi_handle_t *hspi);

hal_status_t HAL_SPI_MASTER_EnableKeepIOState(hal_spi_handle_t *hspi);
hal_status_t HAL_SPI_MASTER_DisableKeepIOState(hal_spi_handle_t *hspi);
hal_spi_master_keep_io_state_status_t HAL_SPI_MASTER_IsEnabledKeepIOState(const hal_spi_handle_t *hspi);

hal_status_t HAL_SPI_EnableMosiMisoSwap(hal_spi_handle_t *hspi);
hal_status_t HAL_SPI_DisableMosiMisoSwap(hal_spi_handle_t *hspi);
hal_spi_mosi_miso_swap_status_t HAL_SPI_IsEnabledMosiMisoSwap(const hal_spi_handle_t *hspi);

hal_status_t HAL_SPI_EnableReadyPin(hal_spi_handle_t *hspi);
hal_status_t HAL_SPI_DisableReadyPin(hal_spi_handle_t *hspi);
hal_spi_ready_pin_status_t HAL_SPI_IsEnabledReadyPin(const hal_spi_handle_t *hspi);
hal_status_t HAL_SPI_SetReadyPinPolarity(hal_spi_handle_t *hspi, hal_spi_ready_pin_polarity_t polarity);
hal_spi_ready_pin_polarity_t HAL_SPI_GetReadyPinPolarity(const hal_spi_handle_t *hspi);

hal_status_t HAL_SPI_EnableDelayReadDataSampling(hal_spi_handle_t *hspi);
hal_status_t HAL_SPI_DisableDelayReadDataSampling(hal_spi_handle_t *hspi);
hal_spi_drds_status_t HAL_SPI_IsEnabledDelayReadDataSampling(const hal_spi_handle_t *hspi);

hal_status_t HAL_SPI_LockIOConfig(const hal_spi_handle_t *hspi);
hal_spi_io_cfg_status_t HAL_SPI_IsLockedIOConfig(const hal_spi_handle_t *hspi);

/**
  * @}
  */

/** @defgroup SPI_Exported_Functions_Group5 Items functions
  * @{
  */
hal_status_t HAL_SPI_SetMode(hal_spi_handle_t *hspi, const hal_spi_mode_t mode);
hal_spi_mode_t HAL_SPI_GetMode(const hal_spi_handle_t *hspi);

hal_status_t HAL_SPI_SetDirection(hal_spi_handle_t *hspi, const hal_spi_direction_t direction);
hal_spi_direction_t HAL_SPI_GetDirection(const hal_spi_handle_t *hspi);

hal_status_t HAL_SPI_SetDataWidth(const hal_spi_handle_t *hspi, const hal_spi_data_width_t data_width);
hal_spi_data_width_t HAL_SPI_GetDataWidth(const hal_spi_handle_t *hspi);

hal_status_t HAL_SPI_SetClockPolarity(hal_spi_handle_t *hspi, const hal_spi_clock_polarity_t clock_polarity);
hal_spi_clock_polarity_t HAL_SPI_GetClockPolarity(const hal_spi_handle_t *hspi);

hal_status_t HAL_SPI_SetClockPhase(hal_spi_handle_t *hspi, const hal_spi_clock_phase_t clock_phase);
hal_spi_clock_phase_t HAL_SPI_GetClockPhase(const hal_spi_handle_t *hspi);

hal_status_t HAL_SPI_SetBaudRatePrescaler(const hal_spi_handle_t *hspi,
                                          const hal_spi_baud_rate_prescaler_t baud_rate_prescaler);
hal_spi_baud_rate_prescaler_t HAL_SPI_GetBaudRatePrescaler(const hal_spi_handle_t *hspi);

hal_status_t HAL_SPI_SetFirstBit(hal_spi_handle_t *hspi, const hal_spi_first_bit_t first_bit);
hal_spi_first_bit_t HAL_SPI_GetFirstBit(const hal_spi_handle_t *hspi);

