MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_spi.h
hal_status_t HAL_SPI_SetNSSPinManagement(hal_spi_handle_t *hspi, hal_spi_nss_pin_management_t nss_pin_management);
hal_spi_nss_pin_management_t HAL_SPI_GetNSSPinManagement(const hal_spi_handle_t *hspi);

hal_status_t HAL_SPI_SetFifoThreshold(const hal_spi_handle_t *hspi, const hal_spi_fifo_threshold_t fifo_threshold);
hal_spi_fifo_threshold_t HAL_SPI_GetFifoThreshold(const hal_spi_handle_t *hspi);

hal_status_t HAL_SPI_MASTER_SetInterDataIdlenessDelay(hal_spi_handle_t *hspi,
                                                      const hal_spi_master_inter_data_idleness_delay_t nb_cycles);
hal_spi_master_inter_data_idleness_delay_t HAL_SPI_MASTER_GetInterDataIdlenessDelay(const hal_spi_handle_t *hspi);

#if defined(USE_HAL_SPI_USER_DATA) && (USE_HAL_SPI_USER_DATA == 1)
void HAL_SPI_SetUserData(hal_spi_handle_t *hspi, const void *p_user_data);
const void *HAL_SPI_GetUserData(const hal_spi_handle_t *hspi);
#endif /* USE_HAL_SPI_USER_DATA == 1 */

#if defined (USE_HAL_SPI_DMA) && (USE_HAL_SPI_DMA == 1)
hal_status_t HAL_SPI_SetTxDMA(hal_spi_handle_t *hspi, hal_dma_handle_t *hdma);
hal_status_t HAL_SPI_SetRxDMA(hal_spi_handle_t *hspi, hal_dma_handle_t *hdma);
#endif /* USE_HAL_SPI_DMA */
/**
  * @}
  */

/** @defgroup SPI_Exported_Functions_Group6 IO operation functions
  * @{
  */
hal_status_t HAL_SPI_Transmit(hal_spi_handle_t *hspi, const void *p_data, uint32_t count_packet, uint32_t timeout_ms);
hal_status_t HAL_SPI_Receive(hal_spi_handle_t *hspi, void *p_data, uint32_t count_packet, uint32_t timeout_ms);
hal_status_t HAL_SPI_TransmitReceive(hal_spi_handle_t *hspi, const void *p_tx_data, void *p_rx_data,
                                     uint32_t count_packet, uint32_t timeout_ms);

hal_status_t HAL_SPI_Transmit_IT(hal_spi_handle_t *hspi, const void *p_data, uint32_t count_packet);
hal_status_t HAL_SPI_Receive_IT(hal_spi_handle_t *hspi, void *p_data, uint32_t count_packet);
hal_status_t HAL_SPI_TransmitReceive_IT(hal_spi_handle_t *hspi, const void *p_tx_data, void *p_rx_data,
                                        uint32_t count_packet);

#if defined(USE_HAL_SPI_DMA) && (USE_HAL_SPI_DMA == 1)
hal_status_t HAL_SPI_Transmit_DMA(hal_spi_handle_t *hspi, const void *p_data, uint32_t count_packet);
hal_status_t HAL_SPI_Receive_DMA(hal_spi_handle_t *hspi, void *p_data, uint32_t count_packet);
hal_status_t HAL_SPI_TransmitReceive_DMA(hal_spi_handle_t *hspi, const void *p_tx_data, void *p_rx_data,
                                         uint32_t count_packet);
#endif /* USE_HAL_SPI_DMA */


hal_status_t HAL_SPI_Abort(hal_spi_handle_t *hspi);
hal_status_t HAL_SPI_Abort_IT(hal_spi_handle_t *hspi);
/**
  * @}
  */

/** @defgroup SPI_Exported_Functions_Group7 IRQ Handler/Callbacks/Register Callbacks functions
  * @{
  */
void HAL_SPI_IRQHandler(hal_spi_handle_t *hspi);
void HAL_SPI_ErrorCallback(hal_spi_handle_t *hspi);
void HAL_SPI_TxCpltCallback(hal_spi_handle_t *hspi);
void HAL_SPI_RxCpltCallback(hal_spi_handle_t *hspi);
void HAL_SPI_TxRxCpltCallback(hal_spi_handle_t *hspi);
void HAL_SPI_TxHalfCpltCallback(hal_spi_handle_t *hspi);
void HAL_SPI_RxHalfCpltCallback(hal_spi_handle_t *hspi);
void HAL_SPI_TxRxHalfCpltCallback(hal_spi_handle_t *hspi);
void HAL_SPI_AbortCpltCallback(hal_spi_handle_t *hspi);
void HAL_SPI_SuspendCallback(hal_spi_handle_t *hspi);

#if defined(USE_HAL_SPI_REGISTER_CALLBACKS) && (USE_HAL_SPI_REGISTER_CALLBACKS == 1)
hal_status_t HAL_SPI_RegisterErrorCallback(hal_spi_handle_t *hspi, hal_spi_cb_t p_callback);
hal_status_t HAL_SPI_RegisterTxCpltCallback(hal_spi_handle_t *hspi, hal_spi_cb_t p_callback);
hal_status_t HAL_SPI_RegisterRxCpltCallback(hal_spi_handle_t *hspi, hal_spi_cb_t p_callback);
hal_status_t HAL_SPI_RegisterTxRxCpltCallback(hal_spi_handle_t *hspi, hal_spi_cb_t p_callback);
hal_status_t HAL_SPI_RegisterTxHalfCpltCallback(hal_spi_handle_t *hspi, hal_spi_cb_t p_callback);
hal_status_t HAL_SPI_RegisterRxHalfCpltCallback(hal_spi_handle_t *hspi, hal_spi_cb_t p_callback);
hal_status_t HAL_SPI_RegisterTxRxHalfCpltCallback(hal_spi_handle_t *hspi, hal_spi_cb_t p_callback);
hal_status_t HAL_SPI_RegisterAbortCpltCallback(hal_spi_handle_t *hspi, hal_spi_cb_t p_callback);
hal_status_t HAL_SPI_RegisterSuspendCallback(hal_spi_handle_t *hspi, hal_spi_cb_t p_callback);
#endif /* USE_HAL_SPI_REGISTER_CALLBACKS */

/**
  * @}
  */

/** @defgroup SPI_Exported_Functions_Group8 Peripheral current frequency, state and errors functions
  * @{
  */
uint32_t HAL_SPI_GetClockFreq(const hal_spi_handle_t *hspi);
hal_spi_state_t HAL_SPI_GetState(const hal_spi_handle_t *hspi);

#if defined(USE_HAL_SPI_GET_LAST_ERRORS) && (USE_HAL_SPI_GET_LAST_ERRORS == 1)
uint32_t HAL_SPI_GetLastErrorCodes(const hal_spi_handle_t *hspi);
#endif /* USE_HAL_SPI_GET_LAST_ERRORS */

/**
  * @}
  */

#if defined(USE_HAL_MUTEX) && (USE_HAL_MUTEX == 1)
/** @defgroup SPI_Exported_Functions_Group9 Acquire/release Bus functions
  * @{
  */
hal_status_t HAL_SPI_AcquireBus(hal_spi_handle_t *hspi, uint32_t timeout_ms);
hal_status_t HAL_SPI_ReleaseBus(hal_spi_handle_t *hspi);

/**
  * @}
  */
#endif /* USE_HAL_MUTEX */

/**
  * @}
  */

/**
  * @}
  */
#endif /* SPI1 || SPI2 || SPI3 */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* STM32C5XX_HAL_SPI_H */
